Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་རྒྱ་ཆེར་བསྟན་དུ་གསོལ།
en: How does a bodhisattva perfect the domain of completely good conduct?”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། །དགེ་བའི་བསོད་ནམས་གང་ཆེན་མཚོ། །དེ་ལྟར་ཁྱོད་ནི་ང་ཡི་དྲུང་དུ་ཉེར་ཕྱིན་ཏེ། །
en: Then Mañjuśrī Kumāra­bhūta recited these verses to Sudhana, the head merchant’s son: “Your coming into my presence Is like an ocean of good merit.

source: སྙིང་རྗེ་སྙིང་བརྩེ་རྒྱ་ཆེན་གྱི། །ཡིད་ལྡན་བྱང་ཆུབ་དམ་པ་ཚོལ་བ་ལེགས། །
en: It is excellent that you seek supreme enlightenment With a mind that has vast loving compassion.

source: འགྲོ་བ་ཐམས་ཅད་དགྲོལ་དོན་དུ། །སྤྱོད་པ་མཚུངས་མེད་དོན་དུ་སྨོན་ལམ་རབ་འདེབས་ཤིང་། །
en: {38} “You have aspired to the unequaled conduct In order to liberate all beings.

source: འགྲོ་བ་ཀུན་གྱི་སྐྱབས་འགྱུར་བ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཚུལ་འདི་ཡིན། །
en: You will become a protector of all beings— That is the way of bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྟན་པ་རྣམས། །འཁོར་བའི་ནང་ན་སྐྱོ་མེད་ཡིད་ཀྱིས་སྤྱོད་བྱེད་པ། །དེ་དག་ཀུན་ཏུ་བཟང་པོ་ཡི། །སྤྱོད་པ་ཐུབ་མེད་ཆགས་མེད་འཐོབ་པར་འགྱུར། །
en: {39} “Those bodhisattvas who are completely resolute, Who have untiring minds in saṃsāra, Attain the conduct that is completely good, That is invincible and unimpeded.

source: བསོད་ནམས་འོད་ཅན་བསོད་ནམས་དཔལ། །དེ་ལྟར་ཁྱོད་ནི་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལ། །འགྲོ་ལ་ཕན་ཕྱིར་སྨོན་བྱེད་པ། །བསོད་ནམས་རྒྱ་མཚོ་དགེ་ཞིང་དག་པའི་མཚན། །
en: {40} “In order to benefit beings, you aspire To the conduct that is completely good, Which has the radiance of merit, the splendor of merit, An ocean of merit, and the emblems of virtue and purity.

source: མཐའ་དང་དབུས་མྱེད་ཚད་མྱེད་པའི། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་སངས་རྒྱས་ཀུན་ཀྱང་མཐོང་བར་འགྱུར། །
en: {41} “In the worlds in the ten directions, you will see the buddhas Who are beyond measure, without center or end.

source: དྲན་པའི་མཐུ་དང་སྟོབས་ཀྱིས་ཀྱང་། །དེ་དག་ཆོས་ཀྱི་སྤྲིན་ཀྱང་ཡོངས་སུ་འཛིན་པར་འགྱུར། །
en: You will possess their clouds of Dharma Through the power and might of your memory.

source: དེ་ལྟར་ཁྱོད་ཀྱིས་ཕྱོགས་བཅུ་ཡི། །སངས་རྒྱས་ཞིང་རྣམས་ཀུན་ཏུ་རྒྱལ་བ་མཐོང་ནས་ཀྱང་། །
en: {42} “In that way, you will see the jinas In all the buddha realms in the ten directions.

source: བྱང་ཆུབ་སྤྱོད་པའི་དོན་གྱི་ཕྱིར། །དེ་དག་ཀུན་ལ་སྨོན་ལམ་རྒྱ་མཚོ་དག་བྱེད་འགྱུར། །
en: And within bodhisattva conduct You will fulfill an ocean of their aspirations.

source: འཇིག་རྟེན་གཙོ་ལ་སློབ་བྱེད་ཅིང་། །གང་རྣམས་སངས་རྒྱས་ས་ལ་གནས་ནི་བཅས་བྱས་ཤིང་། །འདི་ཚུལ་རྒྱ་མཚོར་ཞུགས་གྱུར་པ། །དེ་དག་ཀུན་ཀྱང་ཐམས་ཅད་གཟིགས་པར་འགྱུར། །
en: {43} “Those who enter into an ocean of this way And are established on the level of buddhahood Train under the lords of the world, And thereby they all become omniscient.

source: ཁྱོད་ནི་འབྱམ་ཀླས་ཞིང་ཀུན་ཏུ། །བསྐལ་མང་ཞིང་རྡུལ་སྙེད་དུ་ཀུན་ཏུ་བཟང་པོ་ཡི། །སྤྱོད་པའི་དམ་པ་སྤྱོད་བྱས་ཤིང་། །བྱང་ཆུབ་དམ་པ་ཞི་བ་འཐོབ་པར་འགྱུར། །
en: {44} “You will practice the completely good conduct Throughout the vastness of realms For as many kalpas as numerous as atoms And attain the peace of enlightenment.

source: ཞིང་རྣམས་མཐའ་དང་དབུས་མེད་པ། །མ་ལུས་ཀུན་ཏུ་བསྐལ་པ་རྒྱ་མཚོར་སྤྱད་པར་གྱིས། །ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་མཆོག་ཕྱིར། །སྨོན་ལམ་རྒྱ་ཆེན་ཡོངས་སུ་རྫོགས་པར་བྱོས། །
en: {45} “You should practice for an ocean of kalpas Throughout all the realms, which are without end, And you should fulfill your aspiration For the completely good conduct.

source: ཁྱོད་ནི་སྨོན་ལམ་ཐོས་གྱུར་ནས། །སེམས་ཅན་ཁྲག་ཁྲིག་དགའ་བ་ཡོངས་སུ་སྐྱེས་གྱུར་ཅིང་། །ཀུན་ཏུ་བཟང་པོའི་ཡེ་ཤེས་ཀྱིས། །བྱང་ཆུབ་མཆོག་ཏུ་སྨོན་པ་བྱེད་ལ་ལྟོས། །
en: {46} “Observe a hundred billion beings Who are delighted on hearing your prayer: They aspire to supreme enlightenment Through completely good wisdom.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་བསྒོའོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བཙལ་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ། །
en: {47} Then Mañjuśrī Kumāra­bhūta, having recited those verses, said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have in that way developed the aspiration to enlightenment and have the intention to seek for bodhisattva conduct!

source: རིགས་ཀྱི་བུ་འདི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ལྟ་བུའི་སེམས་ཅན་ཡང་རབ་ཏུ་དཀོན་ཏེ།
en: “Noble one, in that way, the beings who develop the aspiration for the highest, complete enlightenment are very rare.

source: དེ་བས་ཀྱང་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་བ་དེ་ལྟ་བུའི་སེམས་ཅན་ནི་ཆེས་དཀོན་ནོ།
en: Even more rare are the beings who, having developed the aspiration for the highest, complete enlightenment, then seek for bodhisattva conduct.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བའི་ཕྱིར།
en: “Therefore, noble one, bodhisattvas should gain certain knowledge from true kalyāṇamitras.

source: ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་ལས་གདོན་མི་ཟ་བར་རྟོགས་པ་ཐོབ་པར་གྱིས་ཤིག །དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་བཙལ་བ་ལ་ཡོངས་སུ་སྐྱོ་བའི་ཡིད་མེད་པར་གྱིས་ཤིག །
en: They should be tireless in their search for kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་བལྟ་བ་ལ་ངོམས་པ་མེད་པར་གྱིས་ཤིག །
en: They should never have enough of looking at the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྟན་པ་ལ་མཐུན་པར་འཛིན་པར་གྱིས་ཤིག །
en: They should successfully master the teachings of the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཐབས་མཁས་པའི་སྤྱོད་པ་ལ་ཁོང་ཁྲོ་བ་མེད་པར་གྱིས་ཤིག །
en: They should not become angered by the kalyāṇamitras’ conduct of skillful methods.

source: རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན། ཡུལ་མི་མོ་གྱ་ནོམ་མཆོག་ཅེས་བྱ་བ་ཡོད་དེ། དེ་ན་མགུལ་ལེགས་པ་ཞེས་བྱ་བའི་རི་ཞིག་ཡོད་པ་དེ་ལ། དགེ་སློང་སྤྲིན་གྱི་དཔལ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ། །
en: “Noble one, in this southern region there is a land named Rāmāvarānta, in which there is a mountain called Sugrīva, where there lives a bhikṣu by the name of Meghaśrī.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: Go to him and ask him, ‘How do bodhisattvas train in bodhisattva conduct?

source: ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དང་།
en: How do bodhisattvas practice it?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བརྩམ་པར་བྱ་བ་དང་།
en: How do bodhisattvas commence with bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སྤྱད་པར་བྱ་བ་དང་།
en: How do bodhisattvas practice bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་།
en: How do bodhisattvas perfect bodhisattva conduct?

source: ཇི་ལྟར་ཡོངས་སུ་དག་པར་བྱ་བ་དང་།
en: How do they purify it?

source: ཇི་ལྟར་འཇུག་པར་བྱ་བ་དང་།
en: How do they enter it?

source: ཇི་ལྟར་མངོན་པར་བསྒྲུབ་པར་བྱ་བ་དང་།
en: How do they attain it?

source: ཇི་ལྟར་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་།
en: How do they follow it?

source: ཇི་ལྟར་ལྷག་པར་དམིགས་པར་བྱ་བ་དང་།
en: How do they maintain it?

source: ཇི་ལྟར་རྒྱས་པར་བྱ་བ་དང་།
en: How do they increase it?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དྲིས་ཤིག་དང་དགེ་བའི་བཤེས་གཉེན་དེས་ཁྱོད་ལ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་སྟོན་ཏོ། །
en: How do bodhisattvas perfect the domain of completely good conduct?’ “Then that kalyāṇamitra will teach you the domain of completely good conduct.”

source: དེ་ནས་ཚང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Then Sudhana, the head merchant’s son, filled with joy, delighted, elated, pleased, and happy, bowed his head to the feet of Mañjuśrī Kumāra­bhūta.

source: ལན་བརྒྱ་སྟོང་དུ་མར་ཕྱིར་བལྟས་ཏེ། དགེ་བའི་བཤེས་གཉེན་ཡིད་དུ་འོང་བའི་སེམས་དང་ལྡན་པས། དགེ་བའི་བཤེས་གཉེན་མི་མཐོང་བ་མི་བཟོད་དེ། གདོང་མཆི་མས་གང་བར་དུ་ཞིང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་དྲུང་ནས་སོང་ངོ་། །
en: He circumambulated Mañjuśrī Kumāra­bhūta many hundreds of thousands of times, keeping him to his right, and, looking back at him many hundreds of thousands of times, with his mind enraptured by that kalyāṇamitra, unable to endure not seeing that kalyāṇamitra, with his face covered in tears and weeping, he departed from Mañjuśrī Kumāra­bhūta.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་ཡུལ་མི་མོ་གྱ་ནོམ་མཆོག་ཅེས་བྱ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Meghaśrī Chapter 4 Then Sudhana, the head merchant’s son, eventually arrived at the land called Rāmāvarānta.

source: ཡུལ་མི་མོ་གྱ་ནོམ་མཆོག་ནས་རྣམ་པར་བརྒྱུས་ཏེ།
en: Having arrived there, he traveled through the land of Rāmāvarānta.

source: སྔོན་གྱི་དགེ་བའི་རྩ་བས་བྱུང་ཞིང་ལས་རྒྱ་ཆེན་པོས་བྱིན་གྱིས་བརླབས་པའི་ལོངས་སྤྱོད་ཡིད་དུ་འོང་བ་ལ་ཡོངས་སུ་སྤྱོད་ཅིང་རི་མགུལ་ལེགས་པ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Enjoying the delightful pleasures that arose from his past roots of merit and through the power of vast karma, he came to Sugrīva Mountain.

source: མགུལ་ལེགས་པའི་རི་ལ་འཛེགས་ཏེ། དགེ་སློང་སྤྲིན་གྱི་དཔལ་ལ་ཆོས་ཚོལ་ཞིང་། ཤར་ཕྱོགས་ལོགས་སུ་བྱུང་ངོ་། །
en: He climbed Sugrīva Mountain and, seeking the bhikṣu Meghaśrī, he went to its eastern side.

source: དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་སུ་ཡང་བྱུང་སྟེ།
en: In the same way, he went to its southern, western, northern, northeastern, southeastern, southwestern, and northwestern sides, looking up and down for the bhikṣu Meghaśrī.

source: བླ་འོག་ཏུ་འང་ལྟ་ཞིང་དགེ་སློང་སྤྲིན་གྱི་དཔལ་ཚོལ་ཚོལ་བ་ལས་དེས་ཞག་བདུན་ལོན་པ་དང་། དགེ་སློང་སྤྲིན་གྱི་དཔལ་རི་རྩེ་ཅིག་གི་སྨན་ལྗོངས་ན་འཆག་ཅིང་འདུག་པ་མཐོང་ནས།
en: After seven days had passed, he saw the bhikṣu Meghaśrī walking on a plateau on the summit of another mountain.

source: དེ་དགེ་སློང་སྤྲིན་གྱི་དཔལ་གང་ན་བ་དེར་སོང་སྟེ། དགེ་སློང་སྤྲིན་གྱི་དཔལ་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: He went to where the bhikṣu Meghaśrī was and bowed his head to the bhikṣu Meghaśrī’s feet.

source: དགེ་སློང་སྤྲིན་གྱི་དཔལ་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: He circumambulated the bhikṣu Meghaśrī, keeping him to his right.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་ཐུགས་སུ་ཆུད་པར་མཛད་དུ་གསོལ། བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: He sat before him and with palms pressed together said, “Ārya, I wish to know this: When bodhisattvas have developed the aspiration to the highest, complete enlightenment, how do bodhisattvas train in bodhisattva conduct?

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དང་།
en: How do bodhisattvas practice it?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བརྩམ་པ་དང་།
en: How do bodhisattvas commence in bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སྤྱད་པར་བགྱི་བ་དང་།
en: How do bodhisattvas practice bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བ་དང་།
en: How do bodhisattvas perfect bodhisattva conduct?

source: ཇི་ལྟར་ཡོངས་སུ་དག་པར་བགྱི་བ་དང་།
en: How do they purify it?

source: ཇི་ལྟར་འཇུག་པར་བགྱི་བ་དང་།
en: How do they enter it?

source: ཇི་ལྟར་རྗེས་སུ་འབྲང་བར་བགྱི་བ་དང་།
en: How do they attain it?

source: ཇི་ལྟར་མངོན་པར་བསྒྲུབ་པར་བགྱི་བ་དང་།
en: How do they follow it?

source: ཇི་ལྟར་ལྷག་པར་དམིགས་པར་བགྱི་བ་དང་།
en: How do they maintain it?

source: ཇི་ལྟར་རྒྱས་པར་བགྱི་བ་དང་།
en: How do they increase it?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་མ་འཚལ་ཏེ།
en: How do bodhisattvas perfect the domain of completely good conduct?

source: འཕགས་པ་ཁྱོད་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་སྟོན་པ་མཛད་ཅེས་ཐོས་ན།
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འབྱུང་བར་འགྱུར་བ་བདག་ལ་བསྟན་དུ་གསོལ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Therefore, Ārya, teach me how bodhisattvas set out for the highest, complete enlightenment!”

source: དགེ་སློང་སྤྲིན་གྱི་དཔལ་གྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་འདྲི་བ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བཙལ་བ་དང་།
en: The bhikṣu Meghaśrī said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment and are asking about the bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ཡོངས་སུ་བཙལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བ་རྣམ་པར་དག་པ་ཡོངས་སུ་བཙལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་རྣམ་པར་དག་པས་ཡོངས་སུ་བཙལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་ཆེན་པོ་རྣམ་པར་དག་པ་ཡོངས་སུ་བཙལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་བསྒྲུབ་པ་རྣམ་པར་དག་པ་ཡོངས་སུ་བཙལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡོངས་སུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྣང་བའི་སྙིང་རྗེའི་རྒྱུད་ཡོངས་སུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འགྲོ་བའི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔས་འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་སྒོ་ཡོངས་སུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་སྐྱོན་དང་། འཇིགས་པས་མི་གོས་པའི་རྒྱུད་ཡོངས་སུ་བཙལ་བ་འདི་ནི་དཀའོ། །ཤིན་ཏུ་དཀའོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་མོས་པའི་སྟོབས་ཀྱི་དབང་གིས་མིག་གི་བློ་གྲོས་དང་།
en: “Noble one, it is like this: these are difficult, extremely difficult—seeking the bodhisattva conduct, seeking the bodhisattva’s scope of activity, seeking the bodhisattva’s pure setting-forth, seeking the bodhisattva’s pure path, seeking the bodhisattva’s pure, vast conduct, seeking the bodhisattva’s pure attainment of the higher cognitions, manifesting the bodhisattva’s liberations, manifesting the bodhisattva’s continuum of compassion for the world, the bodhisattva’s compliance with the aspirations of beings, the bodhisattva’s revelation of the gateways to saṃsāra and nirvāṇa, and seeking the bodhisattva’s activities that are unstained by composite defects, noncomposite defects, and fear.

source: དད་པའི་མིག་རྣམ་པར་དག་པས་ཀུན་ཏུ་མངོན་པར་ལྟ་བའི་ཡེ་ཤེས་ཀྱི་འོད་སྣང་བ། ཕྱིན་ཕྱོགས་མེད་པ་དང་། ཡུལ་ཀུན་ལ་ཐོགས་པ་མེད་ཅིང་སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་བའི་ལྷག་མཐོང་ལ་མཁས་པ་དང་། མིག་གི་ཡུལ་ཀུན་ནས་ཡོངས་སུ་དག་པའི་ལུས་རྣམ་པར་དག་པ་དང་། ཕྱོགས་ཀྱི་རྒྱུད་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་མངོན་པར་འདུད་པའི་ལུས་ཀྱིས་འདུད་པ་ལ་མཁས་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པའི་གཟུངས་ཀྱི་སྟོབས་ཀྱིས་ཕྱོགས་ཀྱི་རྒྱུད་ཐམས་ཅད་ནས་མངོན་དུ་གཟིགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་མཐོང་སྟེ། འདི་ལྟར་ཤར་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་གཅིག་ཀྱང་མཐོང་ངོ་། །སངས་རྒྱས་གཉིས་དང་བཅུ་དང་། སངས་རྒྱས་བརྒྱ་དང་། སངས་རྒྱས་སྟོང་དང་། སངས་རྒྱས་བརྒྱ་ཕྲག་སྟོང་དང་། སངས་རྒྱས་བྱེ་བ་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་དང་།
en: “Noble one, through the power and might of my aspiration, through having the pure eyes of wisdom and the pure eyes of faith, and by looking straight ahead with the illumination of the light of wisdom, perceiving everything before me, the entire unobstructed field of vision, with a sight that is free of all obscuration, with astute observation, with a completely pure field of vision, and with a pure body, and bowing down toward the extent of every direction with a skillful bowing-down of the body, with the power of retaining the clouds of Dharma of all the buddhas, and with the might of the power of retention, I see the tathāgatas in the realms in every direction before me.

source: སངས་རྒྱས་བྱེ་བ་སྟོང་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ནས་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ། དཔག་ཏུ་མེད་པ། གྲངས་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་མཚུངས་པ་མེད་པ།
en: “In that way, I see one tathāgata in the eastern direction; I see two buddhas, ten buddhas, a hundred buddhas, a thousand buddhas, a hundred thousand buddhas, ten million buddhas, a billion buddhas, ten thousand million buddhas, a trillion buddhas, a quintillion buddhas, and so on up to limitless, immeasurable, countless, inconceivable, unequaled, infinite, endless, incalculable, and more indescribable than indescribable numbers of buddhas.

source: ཀུན་ཏུ་མཐའ་ཡས་པས་མཚམས་མེད་པ། གཞལ་དུ་མེད་པ། བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་མཐོང་ངོ་། །དེ་བཞིན་གཤེགས་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་མཐོང་ངོ་། །དེ་བཞིན་གཤེགས་པ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་བསྙེད་དང་།
en: “I see tathāgatas as numerous as the atoms in Jambudvīpa, tathāgatas as numerous as the atoms in the world realm of four continents, in the world realm of a thousand four-continent worlds, in the world realm of a million four-continent worlds, and in the world realm of a billion four-continent worlds.

source: སྟོང་དང་། སྟོང་གཉིས་པ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་མཐོང་ངོ་། དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་མཐོང་ངོ་། །
en: “I see buddhas as numerous as the atoms in ten buddha realms.

source: དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་།
en: I see buddhas as numerous as the atoms in a hundred buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་།
en: I see buddhas as numerous as the atoms in a thousand buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་།
en: I see buddhas as numerous as the atoms in a hundred thousand buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་།
en: I see buddhas as numerous as the atoms in ten million buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་།
en: I see buddhas as numerous as the atoms in a billion buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་།
en: I see buddhas as numerous as the atoms in ten billion buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་།
en: I see buddhas as numerous as the atoms in a trillion buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ནས།
en: I see buddhas as numerous as the atoms in a quintillion buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་ཀྱང་མཐོང་སྟེ། ཤར་ཕྱོགས་ལོགས་སུ་ཇི་ལྟ་བ་བཞིན་དུ། ལྷོ་ཕྱོགས་དང་ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་།
en: I see buddhas as numerous as the atoms in more indescribable than indescribable numbers of buddha realms.

source: ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་བླའི་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་གཅིག་ཀྱང་མཐོང་བ་ནས། དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་ཀྱང་མཐོང་བའི་བར་དུ་སྟེ། ཕྱོགས་རེ་རེར་རྣམ་པར་བལྟས་ཀྱང་། དེ་བཞིན་གཤེགས་པ་ཁ་དོག་སྣ་ཚོགས་མངའ་བ་དང་། དབྱིབས་སྣ་ཚོགས་མངའ་བ་དང་། རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་མངའ་བ་དང་། ཁྱུ་མཆོག་གི་མཐུ་དང་།
en: “Just as I see in the east, in the south, in the west, in the north, in the northeast, in the southeast, in the southwest, in the northwest, below, and above, I see one tathāgata and so on up to tathāgatas as numerous as the atoms in more indescribable than indescribable numbers of buddha realms.

source: རྣམ་པར་རོལ་པ་སྣ་ཚོགས་མངའ་བ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་རྣམ་པ་སྣ་ཚོགས་མངའ་བ་དང་། འོད་ཟེར་གྱི་དྲ་བ་སྣང་བ་ཁ་དོག་དུ་མ་ཅན་དང་། ཁ་དོག་མཐའ་ཡས་པ་རབ་ཏུ་འགྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པ་དང་། ཕོ་བྲང་དང་རྒྱན་སྣ་ཚོགས་མངའ་བ་དང་། སྐུ་ཚེའི་ཚད་རྣམ་པར་དག་པ་རྣམ་པ་སྣ་ཚོགས་མངའ་བ་དང་། འགྲོ་བའི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པར་མཛད་པ་དང་། མངོན་པར་འཚང་རྒྱ་བ་རྣམ་པར་དག་པའི་སྒོས་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་མངའ་བ་དང་།
en: “In each direction I see tathāgatas of various colors, of various shapes, with various miraculous powers, with various majestic miracles, with various assemblies of followers, shining with networks of many light rays in many colors, in infinite colors, in an array of different pure buddha realms and palaces, with different kinds of pure lifespans, addressing beings in accordance with their aspirations, manifesting different kinds of miracles through the pure attainment of buddhahood, and resounding with the majestic lion’s roar of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་དང་སེང་གེའི་ང་རོ་རྣམ་པར་སྒྲོག་པ་མང་པོ་མཐོང་ངོ་། །དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་སྒོ་ཀུན་ནས་དམིགས་པ་ཐམས་ཅད་རྣམ་པར་རིག་པ་ལ་ཡང་དག་པར་གཞོལ་བའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་འདི་ཐོབ་པར་ཟད་ན།
en: “In that way, noble one, I have attained mindfulness of the buddhas through beholding the aggregation of the knowledge of all objects of perception from all sides.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ་གང་གིས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་ཕོ་བྲང་རྣམ་པར་དག་པའི་རྒྱན་མངོན་པར་མཐོང་བས། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ཀུན་ནས་སྣང་བའི་དཀྱིལ་འཁོར་རབ་ཏུ་ཐོབ་པ་དང་།
en: “But how could I know the conduct or describe the qualities of the pure domain of the infinite wisdom of the bodhisattvas who have attained the gateway of mindfulness of the buddhas called the completely radiant domain through seeing before them the domains of all the tathāgatas, all the displays of pure buddha realms and palaces?

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པར་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་རྣམ་པར་དག་པས། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་འགྲོ་བ་ཐམས་ཅད་དུ་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called all beings through their pure vision of the tathāgatas addressing beings in accordance with their aspirations.

source: གང་གིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཚད་མེད་པའི་རྗེས་སུ་འབྲང་བས་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ། སྟོབས་ཀྱིས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called the ten strengths through following the immeasurable ten strengths of the tathāgatas.

source: གང་གིས་ཆོས་མཉན་པའི་རྣམ་པས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུའི་སྤྲིན་ལ་ལྟ་བས།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called the Dharma through listening to the Dharma while looking upon clouds of the bodies of all the tathāgatas.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ཆོས་ཀྱིས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་གང་གིས་ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་རྒྱ་མཚོ་ཐ་མི་དད་པ་ལ་འཇུག་པས།
en: “They are the ones who have attained the gateway of mindfulness called the essence of the illumination of the directions through entering an undifferentiated ocean of buddhas in the ocean of all the directions.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ཕྱོགས་རྣམ་པར་སྣང་བའི་སྙིང་པོ་རབ་ཏུ་ཐོབ་པ་དང་། གང་གིས་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ལ་རབ་ཏུ་ཕྲ་བར་དམིགས་ཤིང་འཇུག་པས།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called entering the ten directions through perceiving the subtle objects of perception that are the majestic miracles of the tathāgatas.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ཕྱོགས་ཐམས་ཅད་དུ་འཇུག་པ་རབ་ཏུ་ཐོབ་པ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་མཐོང་ཞིང་རྣམ་པར་དམིགས་པ་དང་མི་བྲལ་བས།
en: “They are the ones who have attained the mindfulness of the buddhas called the kalpas through perceiving the vision of never being apart from the tathāgatas of all the kalpas.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་བསྐལ་པར་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་། གང་གིས་དུས་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་མཐོང་ཞིང་འགྲོགས་པ་དང་མི་འབྲལ་བས།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called time through never being separated from the companionship of the vision of the tathāgatas of all times.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་དུས་སུ་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་། གང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནས་མངོན་པར་འཕགས་ཤིང་ཟིལ་གྱིས་མི་ནོན་པའི་སངས་རྒྱས་ཀྱི་སྐུ་ཡོངས་སུ་མཐོང་ཞིང་རྣམ་པར་རིག་པའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ཞིང་དུ་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called the realms through perceiving the vision of the superior buddha realms and the unsurpassable bodies of the buddhas.
